Revit 2026 API

# TopographySurfaceMaterialId Property

---

The id of the material applied to this element.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MaterialId { get; set; }
```
```vb
Public Property MaterialId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member MaterialId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The materialId cannot map to a valid material element. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This applies to TopographySurface and SiteSubRegion elements.

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace